#+TITLE: Rust's Play-Ground

Rust hat wirklich einen [[https://play.rust-lang.org/][Playground]],
den man auch in der Quellkode-Dokumentation verwenden kann.

* Org-Babel Rust

Cargo's subcommand [[https://crates.io/search?q=cargo-script][cargo-script]] let's you run Rust "scripts",
also supported is to evaluate expressions and to run filters.

From  [2]: "... all I had to do was run"
~cargo install cargo-script~
and bam you'll be off and org-babel-ing. If you've got ~Cargo.el~ installed in your profile,
you can evaluate pretty quick using Cargo-run.


#+BEGIN_SRC rust
  // use std::string::String as String; // not required, part of Prelude

  #[derive(std::fmt::Debug)]
  pub struct User {username: String}

  let user: User = User {username: String::from("tilo")};
  println!("{:?}", user);
  /* user cargo-script creates `main() -> ()` main for us
     and this expects no return value */
#+END_SRC

#+RESULTS:
: User { username: "tilo" }

Installed Emacs' Org-Babel support for evaluating [[https://github.com/micanzhang/ob-rust][Rust code]] ~ob-rust~,
which requires the Rust/Cargo ecosystem (=sh.rustup.rs=)
and =cargo-script= installed.

: Evaluate this rust code block on your system? (y or n) y
: error: no such subcommand: `script`

Looks as if I did not install cargo-script yet.

#+BEGIN_EXAMPLE
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ which cargo
  /usr/bin/cargo
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ cargo list
  Installed Commands:
      b                    alias: build
      bench                Execute all benchmarks of a local package
      build                Compile a local package and all of its dependencies
      c                    alias: check
      check                Check a local package and all of its dependencies for errors
      clean                Remove artifacts that cargo has generated in the past
      doc                  Build a package's documentation
      fetch                Fetch dependencies of a package from the network
      fix                  Automatically fix lint warnings reported by rustc
      generate-lockfile    Generate the lockfile for a package
      git-checkout         This subcommand has been removed
      init                 Create a new cargo package in an existing directory
      install              Install a Rust binary. Default location is $HOME/.cargo/bin
      locate-project       Print a JSON representation of a Cargo.toml file's location
      login                Save an api token from the registry locally. If token is not specified, it will be read from stdin.
      metadata             Output the resolved dependencies of a package, the concrete used versions including overrides, in machine-readable format
      new                  Create a new cargo package at <path>
      owner                Manage the owners of a crate on the registry
      package              Assemble the local package into a distributable tarball
      pkgid                Print a fully qualified package specification
      publish              Upload a package to the registry
      r                    alias: run
      read-manifest        Print a JSON representation of a Cargo.toml manifest.
      run                  Run a binary or example of the local package
      rustc                Compile a package, and pass extra options to the compiler
      rustdoc              Build a package's documentation, using specified custom flags.
      search               Search packages in crates.io
      t                    alias: test
      test                 Execute all unit and integration tests and build examples of a local package
      tree                 Display a tree visualization of a dependency graph
      uninstall            Remove a Rust binary
      update               Update dependencies as recorded in the local lock file
      vendor               Vendor all dependencies for a project locally
      verify-project       Check correctness of crate manifest
      version              Show version information
      yank                 Remove a pushed crate from the index
      clippy
      fmt
      miri
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ which rustup
  /usr/bin/rustup
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ rustup component list --installed
  cargo-x86_64-unknown-linux-gnu
  clippy-x86_64-unknown-linux-gnu
  rls-x86_64-unknown-linux-gnu
  rust-analysis-x86_64-unknown-linux-gnu
  rust-docs-x86_64-unknown-linux-gnu
  rust-src
  rust-std-x86_64-unknown-linux-gnu
  rustc-x86_64-unknown-linux-gnu
  rustfmt-x86_64-unknown-linux-gnu
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ ls ~/.cargo/ 
  bin  registry
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ ls -l ~/.cargo/bin/
  insgesamt 29064
  -rwxr-xr-x 1 tilo tilo 23252536 27. Dez 16:19 evcxr
  -rwxr-xr-x 1 tilo tilo  6507304 11. Dez 22:59 rustlings
  [tilo@holm play-rust]$ 
  [tilo@holm play-rust]$ cargo install cargo-script
      Updating crates.io index
   Downloading crates ...
    Downloaded cargo-script v0.2.8
    Installing cargo-script v0.2.8
   Downloading crates ...
    Downloaded getrandom v0.2.0
    Downloaded open v1.4.0
    Downloaded lazy_static v0.2.11
    Downloaded rand_chacha v0.3.0
    Downloaded rand v0.3.23
    Downloaded rustc-serialize v0.3.24
    Downloaded gcc v0.3.55
    Downloaded bitflags v0.5.0
    Downloaded env_logger v0.4.3
    Downloaded aho-corasick v0.5.3
    Downloaded rand v0.8.0
    Downloaded chan v0.1.23
    Downloaded kernel32-sys v0.2.2
    Downloaded winapi-build v0.1.1
    Downloaded itertools v0.5.10
    Downloaded toml v0.2.1
    Downloaded thread_local v0.2.7
    Downloaded rand_core v0.6.0
    Downloaded regex v0.1.80
    Downloaded rand v0.4.6
    Downloaded rustc_version v0.1.7
    Downloaded regex-syntax v0.3.9
    Downloaded semver v0.1.20
    Downloaded thread_local v0.3.6
    Downloaded log v0.3.9
    Downloaded ucd-util v0.1.8
    Downloaded utf8-ranges v1.0.4
    Downloaded aho-corasick v0.6.10
    Downloaded regex v0.2.11
    Downloaded regex-syntax v0.5.6
    Downloaded utf8-ranges v0.1.3
    Downloaded thread-id v2.0.0
    Downloaded memchr v0.1.11
    Downloaded winapi v0.2.8
    Downloaded semver-parser v0.6.2
    Downloaded hoedown v6.0.0
    Downloaded semver v0.5.1
    Downloaded shaman v0.1.0
     Compiling libc v0.2.81
     Compiling cfg-if v0.1.10
     Compiling winapi-build v0.1.1
     Compiling getrandom v0.2.0
     Compiling winapi v0.2.8
     Compiling memchr v2.3.4
     Compiling log v0.4.11
     Compiling gcc v0.3.55
     Compiling regex-syntax v0.3.9
     Compiling regex v0.2.11
     Compiling utf8-ranges v0.1.3
     Compiling bitflags v1.2.1
     Compiling ppv-lite86 v0.2.10
     Compiling lazy_static v1.4.0
     Compiling ucd-util v0.1.8
     Compiling semver v0.1.20
     Compiling rustc-serialize v0.3.24
     Compiling utf8-ranges v1.0.4
     Compiling unicode-width v0.1.8
     Compiling lazy_static v0.2.11
     Compiling ansi_term v0.11.0
     Compiling strsim v0.8.0
     Compiling either v1.6.1
     Compiling bitflags v0.5.0
     Compiling vec_map v0.8.2
     Compiling open v1.4.0
     Compiling kernel32-sys v0.2.2
     Compiling thread_local v0.3.6
     Compiling regex-syntax v0.5.6
     Compiling textwrap v0.11.0
     Compiling rustc_version v0.1.7
     Compiling itertools v0.5.10
     Compiling hoedown v6.0.0
     Compiling cargo-script v0.2.8
     Compiling log v0.3.9
     Compiling aho-corasick v0.6.10
     Compiling memchr v0.1.11
     Compiling thread-id v2.0.0
     Compiling rand v0.4.6
     Compiling atty v0.2.14
     Compiling time v0.1.44
     Compiling toml v0.2.1
     Compiling thread_local v0.2.7
     Compiling aho-corasick v0.5.3
     Compiling clap v2.33.3
     Compiling rand_core v0.6.0
     Compiling regex v0.1.80
     Compiling rand v0.3.23
     Compiling rand_chacha v0.3.0
     Compiling chan v0.1.23
     Compiling rand v0.8.0
     Compiling semver-parser v0.6.2
     Compiling env_logger v0.4.3
     Compiling semver v0.5.1
     Compiling shaman v0.1.0
      Finished release [optimized] target(s) in 59.20s
    Installing /home/tilo/.cargo/bin/cargo-script
    Installing /home/tilo/.cargo/bin/run-cargo-script
     Installed package `cargo-script v0.2.8` (executables `cargo-script`, `run-cargo-script`)
  [tilo@holm play-rust]$ 
#+END_EXAMPLE

Right, we are done and got expected compilation errors.

